<a href="https://colab.research.google.com/github/GPrathap/pythonII/blob/master/master/lesson3/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Section 00**: Introduction හැඳින්වීම

In [2]:
import pandas as pd

**DataFrame** and **Series** are the main objects in pandas 

**දත්ත රාමුව** සහ **ශ්‍රේණිය** පැන්ඩා වල ප්‍රධාන වස්තු වේ

**DataFrame** can be considered as a table. A table is an arrangement of information or data, typically in rows and columns form. In pandas, each column represents an array, namely entry, each of which has a certain value.

**දත්ත රාමුව** වගුවක් ලෙස සැලකිය හැකිය. වගුවක් යනු තොරතුරු හෝ දත්ත සැකසීමකි, සාමාන්‍යයෙන් පේළි සහ තීරු ආකාරයෙන්. පැන්ඩා වල, සෑම තීරුවක්ම නියෝජනය කරන්නේ අරාවකි, එනම් ඇතුළත් කිරීම, ඒ සෑම එකකටම යම් වටිනාකමක් ඇත.

To use the pandas, the first step is to import the library as follows:

පැන්ඩා භාවිතා කිරීම සඳහා, පළමු පියවර නම් **library** පහත පරිදි **import** කිරීමයි:

# **Section 01:** Creating, Reading, and Writing නිර්මාණය කිරීම, කියවීම සහ ලිවීම

**Creating data** දත්ත නිර්මාණය කිරීම

Consider the following example:

පහත උදාහරණය සලකා බලන්න:

In [3]:

pd.DataFrame({"Age":[15, 16], "Height":[140, 155]})

   Age  Height
0   15     140
1   16     155

In this example, **"0, Age"** entry has the value of 15. Similarly, 155 belongs to **"1,Height"** entry. Here, 0 and 1 are the indices.  Instead of 0 and 1, if there is a way to give proper labels for indices, it would be better for several reasons. Let's talk about those reasons bits later. Let's have a look at how to add indices 

මෙම උදාහරණයෙන් "0, වයස" ඇතුළත් වීමේ අගය 15 ක් වන අතර ඒ හා සමානව 155 "1, උස" ඇතුළත් වීමට අයත් වේ. මෙහි 0 සහ 1 යනු දර්ශක වේ. 0 සහ 1 වෙනුවට, දර්ශක සඳහා නිවැරදි ලේබල් ලබා දීමට ක්‍රමයක් තිබේ නම්, හේතු කිහිපයක් නිසා එය වඩා හොඳය. අපි ඒ හේතු ගැන පසුව කතා කරමු. අපි බලමු දර්ශක එකතු කරන්නේ කෙසේද කියා

In [4]:
pd.DataFrame({"Age":[15,16], "Height":[140, 155]}, index=["student1", "student2"])

          Age  Height
student1   15     140
student2   16     155

Let's say we want to add person names as well. Can we include the name in the same DataFrame we created? Yes, it does. DataFrame is not limited to the same data type, e.g., integer it supports multiple datatypes

අපි පුද්ගල නාම ද එක් කිරීමට අවශ්‍ය යැයි සිතමු. අප විසින් සාදන ලද එකම දත්ත රාමුවට නම ඇතුළත් කළ හැකිද? ඔව්, එය කරයි. ඩේටා ෆ්‍රේම් එකම දත්ත වර්ගයකට පමණක් සීමා නොවේ, උදාහරණයක් ලෙස, එය බහු දත්ත වර්ග වලට සහය දක්වයි

In [5]:
pd.DataFrame({"Age":[15, 16], "Height":[140, 155], "Name":["Tom Lul", "Tim Dima"]}, index=["student1", "student2"])

          Age  Height      Name
student1   15     140   Tom Lul
student2   16     155  Tim Dima

**Series** 

A **Series**, by contrast, is a sequence of data values. Since **DataFrame** is a table, **Series** is a column of a DataFrame. In other words, DataFrame is a collection of Series. Let's try to construct the above DataFrame using Series object   

A **ශ්‍රේණිය**, ඊට වෙනස්ව, දත්ත අගයන් අනුපිළිවෙලකි. **දත්ත රාමුව** වගුවක් බැවින්, **ශ්‍රේණිය** යනු දත්ත රාමුවක තීරුවකි. වෙනත් වචන වලින් කිවහොත්, දත්ත රාමුව යනු මාලාවක එකතුවකි. ශ්‍රේණි වස්තුවක් භාවිතා කර ඉහත දත්ත රාමුව තැනීමට උත්සාහ කරමු

In [6]:
age = pd.Series([15,16], index=["student1", "student2"], name="age")
height = pd.Series([140, 155], index=["student1", "student2"], name="height")
name = pd.Series(["Tom Lul", "Tim Dima"], index=["student1", "student2"], name="name")

df = pd.DataFrame({"Age": age, "Height":height, "Name":name})
df

          Age  Height      Name
student1   15     140   Tom Lul
student2   16     155  Tim Dima

**Reading and Writing Files** ලිපිගොනු කියවීම සහ ලිවීම

If you want to save the student information

ඔබට ශිෂ්‍ය තොරතුරු සුරැකීමට අවශ්‍ය නම්

In [7]:
df.to_csv("/content/sample_data/student_info.csv", index="true", header="true")

How can we read the data from a file?

ගොනුවකින් දත්ත කියවන්නේ කෙසේද?

In [8]:
df_mod = pd.read_csv("/content/sample_data/student_info.csv")
df_mod

  Unnamed: 0  Age  Height      Name
0   student1   15     140   Tom Lul
1   student2   16     155  Tim Dima

In [9]:
df_mod = pd.read_csv("/content/sample_data/student_info.csv", index_col=0)
df_mod

          Age  Height      Name
student1   15     140   Tom Lul
student2   16     155  Tim Dima

In [10]:
df_mod.head()

          Age  Height      Name
student1   15     140   Tom Lul
student2   16     155  Tim Dima

# **Section 02**: Accessing, Indexing, Selecting, and Assigning ප්‍රවේශ වීම, සුචිගත කිරීම, තෝරා ගැනීම සහ පැවරීම

**Accessing the data** දත්ත වලට ප්‍රවේශ වීම

In Python, the properties of an object can be accessed by those attributes. DataFrame works in much as the same way  

**Python** වලදී වස්තුවක ගුණාංග වලට එම ලක්‍ෂණ මඟින් ප්‍රවේශ විය හැකිය. දත්ත රාමුව බොහෝ දුරට එකම ආකාරයකින් ක්‍රියා කරයි

In [11]:
df_mod.Age

student1    15
student2    16
Name: Age, dtype: int64

In [12]:
df_mod['Age']

student1    15
student2    16
Name: Age, dtype: int64

In [13]:
df_mod['Age']['student1']

15

In [14]:
df_mod['Age'][0]

15

**Indexing** සුචිගත කිරීම 

As shown in the latter example, the indexing operator in Pandas works in much the same way. Yet, for advance operations Panda offers two accessor operations:

පෙර උදාහරණයේ දැක්වෙන පරිදි, පැන්ඩස් හි සුචිගත කිරීමේ ක්‍රියාකරු බොහෝ දුරට එකම ආකාරයකින් ක්‍රියා කරයි. කෙසේ වෙතත්, අත්තිකාරම් මෙහෙයුම් සඳහා පැන්ඩා ප්‍රවේශක මෙහෙයුම් දෙකක් ඉදිරිපත් කරයි:

**loc**: index-based selection (selecting based on its numerical position) දර්ශකය පදනම් කරගත් තේරීම (එහි සංඛ්‍යාත්මක පිහිටීම මත පදනම්ව තෝරා ගැනීම)

**iloc**: label-based selection (selecting based on its index value not the position) ලේබලය පදනම් කරගත් තේරීම (එහි දර්ශක අගය මත පදනම්ව තෝරා ගැනීම නොව ස්ථානය මත පදනම්ව තෝරා ගැනීම)

In [15]:
df_mod.loc['student1']

Age            15
Height        140
Name      Tom Lul
Name: student1, dtype: object

In [16]:
df_mod.iloc[0]

Age            15
Height        140
Name      Tom Lul
Name: student1, dtype: object

In [17]:
df_mod.loc['student1', 'Age']

15

In [18]:
df_mod.iloc[0,0]

15

In [19]:
df_mod.loc['student1', ['Age', 'Height']]

Age        15
Height    140
Name: student1, dtype: object

In [20]:
df_mod.iloc[0, [0,1]]

Age        15
Height    140
Name: student1, dtype: object

In [21]:
df_mod.iloc[0,:]

Age            15
Height        140
Name      Tom Lul
Name: student1, dtype: object

In [22]:
df_mod.loc[['student1', 'student2'], 'Age']

student1    15
student2    16
Name: Age, dtype: int64

In [23]:
df_mod.iloc[[0,1], 0]

student1    15
student2    16
Name: Age, dtype: int64

In [24]:
df_mod.loc[:, "Age"]

student1    15
student2    16
Name: Age, dtype: int64

In [25]:
df_mod.iloc[:, 0]

student1    15
student2    16
Name: Age, dtype: int64

In [26]:
df_mod.iloc[-1]

Age             16
Height         155
Name      Tim Dima
Name: student2, dtype: object

**Manipulating the index** දර්ශකය හැසිරවීම

In Pandas, an index is not immutable. Hence, we have the freedom to modify the index in the way we want. Let's say we want to index based on the names of students

පාණ්ඩවල දර්ශකයක් නොවෙනස්ව පවතී. එම නිසා අපට අවශ්‍ය පරිදි දර්ශකය වෙනස් කිරීමේ නිදහස අපට ඇත. සිසුන්ගේ නම් පදනම් කරගෙන අපට සුචිගත කිරීමට අවශ්‍ය යැයි සිතමු

In [27]:
df_mod

          Age  Height      Name
student1   15     140   Tom Lul
student2   16     155  Tim Dima

In [28]:
df_mod.set_index("Name")

          Age  Height
Name
Tom Lul    15     140
Tim Dima   16     155

Or how can we rename the index completely? you can use `set_aixs` to replace any *axis*

නැත්නම් අපි දර්ශකය සම්පූර්ණයෙන්ම නැවත නම් කරන්නේ කෙසේද? ඕනෑම *අක්ෂයක් *වෙනුවට ඔබට `axis` භාවිතා කළ හැකිය.

In [29]:
df_mod.set_axis(['s1', 's2'], axis='index')

    Age  Height      Name
s1   15     140   Tom Lul
s2   16     155  Tim Dima

In [30]:
df_mod.set_axis(['s1', 's2'], axis=0)

    Age  Height      Name
s1   15     140   Tom Lul
s2   16     155  Tim Dima

Can you guess `df_mod.set_axis(['age', 'height', 'name'], axis=1)` result of this? 

ඔයාට අනුමාන කරන්න පුලුවන්ද `df_mod.set_axis(['age', 'height', 'name'], axis=1)` මෙහි ප්‍රතිඵලය?

**Different ways of selections** තෝරා ගැනීමේ විවිධ ක්‍රම

Let's say, in the class, we have a few more people, but still, there are some information is missing 

අපි කියමු, පන්තියේදී, අපට තවත් පුද්ගලයින් කිහිප දෙනෙක් සිටියත්, තවමත් සමහර තොරතුරු නැති වී තිබේ

In [31]:
import numpy as np 

df_new = pd.DataFrame({"Age":[15, 16, np.nan, 18], "Height":[140, 155, 167, np.nan]
                       , "Name":["Tom Lul", "Tim Dima", "Bulad Max", "Savira Lavix"]}
                      , index=["student1", "student2", "student3", "student4"])
df_new

           Age  Height          Name
student1  15.0   140.0       Tom Lul
student2  16.0   155.0      Tim Dima
student3   NaN   167.0     Bulad Max
student4  18.0     NaN  Savira Lavix

How can we know all the students' names who are higher than 150 cm?

සෙන්ටිමීටර 150 ට වැඩි සියලුම සිසුන්ගේ නම් අපි දැන ගන්නේ කෙසේද?

Let's go through step by step 

අපි පියවරෙන් පියවර ඉදිරියට යමු

In [32]:
df_new.Height>=150 #selecting students who are higher than 150cm. In the result

student1    False
student2     True
student3     True
student4    False
Name: Height, dtype: bool

In [33]:
df_new.loc[df_new.Height >= 150]  # this gives the part of the DataFrame we are interested in

           Age  Height       Name
student2  16.0   155.0   Tim Dima
student3   NaN   167.0  Bulad Max

`df_new.loc[df_new.Height >= 150]` same work can be done incorporating `np.where` API as well 

`df_new.loc[df_new.Height >= 150]` ඇතුළත් කිරීම මඟින් එම කාර්යයම කළ හැකිය `np.where` ඒපීඅයි ද

In [34]:
np.where(df_new.Height>=150)[0] # this gives indices of those students මෙය එම සිසුන්ගේ දර්ශක ලබා දෙයි

array([1, 2])

In [35]:
df_new.iloc[np.where(df_new.Height>=150)[0]] # this gives the part of the DataFrame we are interested in මෙය අපි උනන්දුවක් දක්වන දත්ත රාමුවේ කොටසක් ලබා දේ

           Age  Height       Name
student2  16.0   155.0   Tim Dima
student3   NaN   167.0  Bulad Max

In [36]:
df_new.loc[df_new.Height >= 150].Name # since names of those students what we need. Retrieving only the names ඒ සිසුන්ගේ නම් වලින් අපට අවශ්‍ය දේ. නම් පමණක් ලබා ගැනීම

student2     Tim Dima
student3    Bulad Max
Name: Name, dtype: object

In [37]:
df_new.iloc[np.where(df_new.Height>=150)[0]].Name

student2     Tim Dima
student3    Bulad Max
Name: Name, dtype: object

Now let's say, we need students who are higher than 150 and whose age higher than 16 

දැන් අපි කියමු, අපට අවශ්‍ය වන්නේ 150 ට වඩා වැඩි සහ 16 ට වැඩි වයසේ සිටින සිසුන් ය

In [38]:
df_new.loc[ (df_new.Height > 150) & (df_new.Age >= 16)]

           Age  Height      Name
student2  16.0   155.0  Tim Dima

How about students who are higher than 150 or age higher than 16

150 ට වඩා වැඩි හෝ 16 ට වැඩි වයසේ පසුවන සිසුන් ගැන කෙසේ කිව හැකිද?

In [39]:
df_new.loc[ (df_new.Height > 150) | (df_new.Age >= 16)]

           Age  Height          Name
student2  16.0   155.0      Tim Dima
student3   NaN   167.0     Bulad Max
student4  18.0     NaN  Savira Lavix

As you can see, here for some information are missing, i.e., the information provided with NaN

ඔබට දැකිය හැකි පරිදි, මෙහි සමහර තොරතුරු නැති වී ඇත, එනම් NaN සමඟ ලබා දුන් තොරතුරු

How to retrieve students who have missing information

අතුරුදහන් වූ තොරතුරු ඇති සිසුන් නැවත ලබා ගන්නේ කෙසේද?

In [40]:
df_new.loc[df_new.Age.isin([np.nan]) | df_new.Height.isin([np.nan]) | df_new.Name.isin([np.nan])]

           Age  Height          Name
student3   NaN   167.0     Bulad Max
student4  18.0     NaN  Savira Lavix

How to retrieve students who have provided their height 

තම උස සපයා ඇති සිසුන් නැවත ලබා ගන්නේ කෙසේද?

In [41]:
df_new.loc[ df_new.Height.notnull()]

           Age  Height       Name
student1  15.0   140.0    Tom Lul
student2  16.0   155.0   Tim Dima
student3   NaN   167.0  Bulad Max

**Assigning data** දත්ත පැවරීම

Student3 age is 17. How can you update the corresponding entry?

ශිෂ්‍යයාගේ වයස අවුරුදු 17 යි. අනුරූප ඇතුළත් කිරීම ඔබ යාවත්කාලීන කරන්නේ කෙසේද?

In [42]:
df_new['Age'].student3 = 17
df_new

/usr/local/lib/python3.7/dist-packages/pandas/core/generic.py:5170: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

           Age  Height          Name
student1  15.0   140.0       Tom Lul
student2  16.0   155.0      Tim Dima
student3  17.0   167.0     Bulad Max
student4  18.0     NaN  Savira Lavix

In [43]:
df_new['Age'][2] = 17
df_new

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

           Age  Height          Name
student1  15.0   140.0       Tom Lul
student2  16.0   155.0      Tim Dima
student3  17.0   167.0     Bulad Max
student4  18.0     NaN  Savira Lavix

# **Section 03**: Building Summary Functions and Maps දැනට පවතින සාරාංශ කාර්යයන් සහ සිතියම්

**Build-in summary functions** දැනට පවතින සාරාංශ කාර්යයන්

There are several useful APIs that can be used for describing and visualization properties of data 

දත්ත වල ගුණාංග විස්තර කිරීම සහ දෘශ්‍යකරණය සඳහා භාවිතා කළ හැකි ප්‍රයෝජනවත් ඒපීඅයි කිහිපයක් තිබේ

In [44]:
df_new = pd.DataFrame({"age":[15, 16, np.nan, 18], "height":[140, 155, 167, np.nan]
                       , "name":["Tom Lul", "Tim Maxwell", "Tim Dima", "Savi Lavix"], "mark":[45, 67, 89, 67]}
                      , index=["student1", "student2", "student3", "student4"])
df_new

           age  height         name  mark
student1  15.0   140.0      Tom Lul    45
student2  16.0   155.0  Tim Maxwell    67
student3   NaN   167.0     Tim Dima    89
student4  18.0     NaN   Savi Lavix    67

Let's see what it describes in default 

එය පෙරනිමියෙන් විස්තර කරන්නේ කුමක්දැයි බලමු

In [45]:
df_new.describe()

             age      height       mark
count   3.000000    3.000000   4.000000
mean   16.333333  154.000000  67.000000
std     1.527525   13.527749  17.962925
min    15.000000  140.000000  45.000000
25%    15.500000  147.500000  61.500000
50%    16.000000  155.000000  67.000000
75%    17.000000  161.000000  72.500000
max    18.000000  167.000000  89.000000

In [46]:
df_new.describe(include='all')

              age      height      name       mark
count    3.000000    3.000000         4   4.000000
unique        NaN         NaN         4        NaN
top           NaN         NaN  Tim Dima        NaN
freq          NaN         NaN         1        NaN
mean    16.333333  154.000000       NaN  67.000000
std      1.527525   13.527749       NaN  17.962925
min     15.000000  140.000000       NaN  45.000000
25%     15.500000  147.500000       NaN  61.500000
50%     16.000000  155.000000       NaN  67.000000
75%     17.000000  161.000000       NaN  72.500000
max     18.000000  167.000000       NaN  89.000000

In [47]:
df_new.name.describe()

count            4
unique           4
top       Tim Dima
freq             1
Name: name, dtype: object

In [48]:
df_new.mark.describe()

count     4.000000
mean     67.000000
std      17.962925
min      45.000000
25%      61.500000
50%      67.000000
75%      72.500000
max      89.000000
Name: mark, dtype: float64

In [49]:
df_new.mark.mean()

67.0

In [50]:
df_new.name.value_counts()

Tim Dima       1
Tom Lul        1
Tim Maxwell    1
Savi Lavix     1
Name: name, dtype: int64

**Mapping** සිතියම් ගත කිරීම

In general, mapping means apply a transformation, e.g., function, a given set of values into another set of values. For example, say we need to understand how marks deviated around its of the mean

පොදුවේ ගත් කල, සිතියම් ගත කිරීම යනු යම් අගයන් සමූහයක් වෙනත් අගයන් සමූහයක් බවට පරිවර්තනයක් යෙදීමයි. උදාහරණයක් වශයෙන්, එහි මධ්‍යන්‍යය වටා ලකුණු අපගමනය වී ඇති ආකාරය අප තේරුම් ගත යුතු යැයි කියන්න

In [51]:
marks_mean = df_new.mark.mean()

def centering(row):
  return row.mark - marks_mean 

df_new.apply(centering, axis="columns")

student1   -22.0
student2     0.0
student3    22.0
student4     0.0
dtype: float64

the same things can be done in the following:

පහත සඳහන් දේ වලින් එකම දේ කළ හැකිය:

In [52]:
df_new.mark.map(lambda p: p-marks_mean)

student1   -22.0
student2     0.0
student3    22.0
student4     0.0
Name: mark, dtype: float64

# **Section 04**: Grouping කණ්ඩායම් කිරීම

**Groupwise Operations** කණ්ඩායම් වශයෙන් මෙහෙයුම්

In [53]:
df_new.groupby('mark').mark.count()

mark
45    1
67    2
89    1
Name: mark, dtype: int64

In [54]:
df_new.groupby('mark').apply(lambda df: df.height)

mark
45    student1    140.0
67    student2    155.0
      student4      NaN
89    student3    167.0
Name: height, dtype: float64

In [55]:
df_new.groupby(['mark', 'age']).apply(lambda df: df.height)

mark  age
45    15.0  student1    140.0
67    16.0  student2    155.0
      18.0  student4      NaN
Name: height, dtype: float64

In [56]:
df_new.groupby('mark').apply(lambda df: df.mark).agg([len, min, max])

len     4
min    45
max    89
Name: mark, dtype: int64

# **Section 05**: Data Types and Missing Values දත්ත වර්ග සහ නැතිවූ අගයන්

**Dealing with missing data** නැතිවූ දත්ත සමඟ කටයුතු කිරීම

Data type of each column can be check by accessing **dtype** property

**dtype** වෙත ප්‍රවේශ වීමෙන් එක් එක් තීරුවේ දත්ත වර්ගය පරීක්‍ෂා කළ හැකිය

In [57]:

df_new.age.dtype

dtype('float64')

In [58]:
df_new.dtypes

age       float64
height    float64
name       object
mark        int64
dtype: object

Data type any entry can be changed using **astype(dtype)** function. In general, age is represented in an integer. Can you use change the age column into integer values? Since one value is not defined, NaN, the first step is to remove those undefined values 

දත්ත වර්ගය ඕනෑම ඇතුළත් කිරීමක් ** astype (dtype) ** ශ්‍රිතය භාවිතයෙන් වෙනස් කළ හැකිය. පොදුවේ ගත් කල, වයස නිරූපණය වන්නේ නිඛිලයකින් ය. ඔබට වයස් තීරුව නිඛිල අගයන් ලෙස වෙනස් කිරීමට භාවිතා කළ හැකිද? එක් අගයක් නිර්වචනය කර නැති හෙයින්, පළමු පියවර නම් එම නිර්වචනය නොකළ අගයන් ඉවත් කිරීමයි

In [59]:
#df_new.age.astype(np.int) #You will get an error

In [60]:
pd.isnull(df_new.age)

student1    False
student2    False
student3     True
student4    False
Name: age, dtype: bool

In [61]:
df_new.age.isnull()

student1    False
student2    False
student3     True
student4    False
Name: age, dtype: bool

In [62]:
df_new.age[~df_new.age.isnull()]

student1    15.0
student2    16.0
student4    18.0
Name: age, dtype: float64

In [63]:
df_new.age[~df_new.age.isnull()].astype("int64")

student1    15
student2    16
student4    18
Name: age, dtype: int64

In [64]:
df_new.age.fillna("Unknown")

student1         15
student2         16
student3    Unknown
student4         18
Name: age, dtype: object

Now type if age becomes object since datatypes are mixed of integer and string. Moreover, if we know the values to be replaced, we can use the **replace** function 

දැන් සංඛ්‍යාංකය හා තන්තුව මිශ්‍ර වී ඇති බැවින් වයස් කාලය වස්තුවක් බවට පත් වුවහොත් ටයිප් කරන්න. එපමණක් නොව, ආදේශ කළ යුතු අගයන් අප දන්නේ නම්, අපට ** ප්‍රතිස්ථාපන ** ශ්‍රිතය භාවිතා කළ හැකිය

In [65]:
df_new.age

student1    15.0
student2    16.0
student3     NaN
student4    18.0
Name: age, dtype: float64

In [66]:
df_new.age = df_new.age.replace(np.nan, 45)

# **Section 06**: Renaming and Combining නැවත නම් කිරීම සහ ඒකාබද්ධ කිරීම

**Renaming** නැවත නම් කිරීම

We can rename any column or index using rename() function 

නැවත නම් කිරීමේ  ශ්‍රිතය භාවිතයෙන් අපට ඕනෑම තීරුවක් හෝ දර්ශකයක් නැවත නම් කළ හැකිය

In [67]:
df_new.rename(columns={'name':"full_name"})

           age  height    full_name  mark
student1  15.0   140.0      Tom Lul    45
student2  16.0   155.0  Tim Maxwell    67
student3  45.0   167.0     Tim Dima    89
student4  18.0     NaN   Savi Lavix    67

In [68]:
df_new.rename(index={'student1':'s1', 'student3':'s3'})

           age  height         name  mark
s1        15.0   140.0      Tom Lul    45
student2  16.0   155.0  Tim Maxwell    67
s3        45.0   167.0     Tim Dima    89
student4  18.0     NaN   Savi Lavix    67

In order to to rename or add axis names, we can use **rename_axis()**

අක්ෂයේ නම් නැවත නම් කිරීමට හෝ එකතු කිරීමට අපට **rename_axis ()** භාවිතා කළ හැකිය.

In [69]:
df_new.rename_axis("index", axis="rows").rename_axis("information", axis='columns')

information   age  height         name  mark
index
student1     15.0   140.0      Tom Lul    45
student2     16.0   155.0  Tim Maxwell    67
student3     45.0   167.0     Tim Dima    89
student4     18.0     NaN   Savi Lavix    67

**Combining** ඒකාබද්ධ කිරීම

Let's say class A and class B student details are given as follows:

A සහ B පන්තියේ සිසුන්ගේ විස්තර පහත පරිදි ලබා දී ඇතැයි කියමු:

In [70]:
class_A = pd.DataFrame({"age":[15, 16, 23, 18], "height":[140, 155, 167, 178]
                       , "name":["Tom Lul", "Tim Maxwell", "Tim Dima", "Savi Lavix"], "mark":[45, 67, 89, 67]}
                      , index=["a_s1", "a_s2", "a_s3", "a_s4"])
class_A

      age  height         name  mark
a_s1   15     140      Tom Lul    45
a_s2   16     155  Tim Maxwell    67
a_s3   23     167     Tim Dima    89
a_s4   18     178   Savi Lavix    67

In [71]:

class_B = pd.DataFrame({"age":[16, 14, 19, 16], "height":[120, 175, 187, 146]
                       , "name":["Mina Vox", "Luna Bulad", "Bulga Martib", "Savin Lulax"], "mark":[4,45, 28, 89]}
                      , index=["b_s1", "b_s2", "b_s3", "b_s4"])
class_B

      age  height          name  mark
b_s1   16     120      Mina Vox     4
b_s2   14     175    Luna Bulad    45
b_s3   19     187  Bulga Martib    28
b_s4   16     146   Savin Lulax    89

Now we need to check who scored the maximum mark? How can we do this?

දැන් අපි පරීක්‍ෂා කළ යුත්තේ වැඩිම ලකුණු ලබාගත්තේ කවුද? අපට මෙය කළ හැක්කේ කෙසේද?

In [72]:
classes = pd.concat([class_A, class_B])
classes

      age  height          name  mark
a_s1   15     140       Tom Lul    45
a_s2   16     155   Tim Maxwell    67
a_s3   23     167      Tim Dima    89
a_s4   18     178    Savi Lavix    67
b_s1   16     120      Mina Vox     4
b_s2   14     175    Luna Bulad    45
b_s3   19     187  Bulga Martib    28
b_s4   16     146   Savin Lulax    89

In [73]:
classes.age.idxmax()

'a_s3'

Let's say we want to find students with same age

සම වයසේ දරුවන් සොයා ගැනීමට අවශ්‍ය යැයි සිතමු

In [74]:
classes.groupby("age").apply(lambda df: df.age)

age
14   b_s2    14
15   a_s1    15
16   a_s2    16
     b_s1    16
     b_s4    16
18   a_s4    18
19   b_s3    19
23   a_s3    23
Name: age, dtype: int64